#include "GBAGfx.h"
#include "../System.h"
#include <string.h>

int coeff[32] = {
   0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15,
   16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16
};

uint32_t line0[240];
uint32_t line1[240];
uint32_t line2[240];
uint32_t line3[240];
uint32_t lineOBJ[240];
uint32_t lineOBJWin[240];
bool gfxInWin0[240];
bool gfxInWin1[240];
int lineOBJpixleft[128];

lcd_background_t lcd_bg[4];

static inline void gfxClearArray(uint32_t* array)
{
   for (int i = 0; i < 240;)
   {
      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;

      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;

      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;

      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;
      *array++ = 0x80000000;

      i += 16;
   }
}

void forceBlankLine(pixFormat* lineMix)
{
   for (int x = 0; x < 240; ++x)
   {
      lineMix[x] = MAKECOLOR(0x7fff);
   }
}

static int textModeSizeMapX[4] = { 256, 512, 256, 512 };
static int textModeSizeMapY[4] = { 256, 256, 512, 512 };

#ifdef TILED_RENDERING
#ifdef _MSC_VER
union uint8_th {
   __pragma(pack(push, 1));
   struct
   {
#ifdef MSB_FIRST
      /* 4*/ unsigned char hi : 4;
      /* 0*/ unsigned char lo : 4;
#else
      /* 0*/ unsigned char lo : 4;
      /* 4*/ unsigned char hi : 4;
#endif
   } __pragma(pack(pop));
   uint8_t val;
};
#else // !_MSC_VER
union uint8_th {
   struct
   {
#ifdef MSB_FIRST
      /* 4*/ unsigned char hi : 4;
      /* 0*/ unsigned char lo : 4;
#else
      /* 0*/ unsigned char lo : 4;
      /* 4*/ unsigned char hi : 4;
#endif
   } __attribute__((packed));
   uint8_t val;
};
#endif

union TileEntry {
   struct
   {
#ifdef MSB_FIRST
      /*14*/ unsigned palette : 4;
      /*13*/ unsigned vFlip : 1;
      /*12*/ unsigned hFlip : 1;
      /* 0*/ unsigned tileNum : 10;
#else
      /* 0*/ unsigned tileNum : 10;
      /*12*/ unsigned hFlip : 1;
      /*13*/ unsigned vFlip : 1;
      /*14*/ unsigned palette : 4;
#endif
   };
   uint16_t val;
};

struct TileLine
{
   uint32_t pixels[8];
};

typedef const TileLine (*TileReader)(const uint16_t*, const int, const uint8_t*, uint16_t*, const uint32_t);

static inline void gfxDrawPixel(uint32_t* dest, const uint8_t color, const uint16_t* palette, const uint32_t prio)
{
   *dest = color ? (READ16LE(&palette[color]) | prio) : 0x80000000;
}

inline const TileLine gfxReadTile(const uint16_t* screenSource, const int yyy, const uint8_t* charBase, uint16_t* palette, const uint32_t prio)
{
   TileEntry tile;
   tile.val = READ16LE(screenSource);

   int tileY = yyy & 7;
   if (tile.vFlip)
      tileY = 7 - tileY;
   TileLine tileLine;

   const uint8_t* tileBase = &charBase[tile.tileNum * 64 + tileY * 8];

   if (!tile.hFlip)
   {
      gfxDrawPixel(&tileLine.pixels[0], tileBase[0], palette, prio);
      gfxDrawPixel(&tileLine.pixels[1], tileBase[1], palette, prio);
